{
  "_name_or_path": "/home/artem/work/programming/deep_learning_nlp/weights/rubert/models--cointegrated--rubert-tiny2/snapshots/dad72b8f77c5eef6995dd3e4691b758ba56b90c3",
  "architectures": [
    "BertForPreTraining"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "emb_size": 312,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 312,
  "initializer_range": 0.02,
  "intermediate_size": 600,
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 2048,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 3,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "transformers_version": "4.33.0.dev0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 83828
}
